saksham-uw/hermes/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# Hermes defaults (override in menuconfig)
CONFIG_HERMES_WIFI_SSID="YOUR_WIFI"
CONFIG_HERMES_WIFI_PASSWORD="YOUR_PASSWORD"
CONFIG_HERMES_IOT_ENDPOINT="acp99wijypwjp-ats.iot.us-east-1.amazonaws.com"
CONFIG_HERMES_USER_ID="saksham"
CONFIG_HERMES_THING_NAME="hermes-device"
CONFIG_HERMES_UI_CONSOLE=y
